## Random Forest

In this project I've used Random forest classification algorithm on Titanic dataset and evaluated accuracy computed by it.

In [14]:
import pandas as pd
from sklearn.ensemble import RandomForestClassifier
from sklearn.model_selection import train_test_split
from sklearn.metrics import roc_auc_score

In [2]:
df= pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'], axis=1, inplace=True)

#### Converted Sex column into categorical.

In [4]:
dummy_df= pd.get_dummies(df.Sex)
dummy_df.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [5]:
df= pd.concat([df, dummy_df], axis=1)
df.head()

   Survived  Pclass     Sex   Age     Fare  female  male
0         0       3    male  22.0   7.2500       0     1
1         1       1  female  38.0  71.2833       1     0
2         1       3  female  26.0   7.9250       1     0
3         1       1  female  35.0  53.1000       1     0
4         0       3    male  35.0   8.0500       0     1

In [6]:
df.drop(['Sex'], axis=1, inplace= True)
df.head()

   Survived  Pclass   Age     Fare  female  male
0         0       3  22.0   7.2500       0     1
1         1       1  38.0  71.2833       1     0
2         1       3  26.0   7.9250       1     0
3         1       1  35.0  53.1000       1     0
4         0       3  35.0   8.0500       0     1

In [7]:
df.isnull().sum()

Survived      0
Pclass        0
Age         177
Fare          0
female        0
male          0
dtype: int64

#### Imputation

In [8]:
df.Age= df.Age.fillna(int(df.Age.mean()))

#### Split the df

In [9]:
X= df.drop(['Survived'], axis=1)

In [10]:
y= df.Survived

In [11]:
X_train, X_test, y_train, y_test= train_test_split(X, y, train_size=0.8, random_state=1)

#### Training the model

In [116]:
model= RandomForestClassifier(n_estimators= 20, max_depth= 5, min_samples_leaf= 2)
model.fit(X_train, y_train)
predictions_test= model.predict(X_test)

In [117]:
test_score= roc_auc_score(y_test, predictions_test)
test_score

0.7841819591625743

In [118]:
predictions_train= model.predict(X_train)
train_score= roc_auc_score(y_train, predictions_train)
train_score

0.837157098861262

In [120]:
print(f'Accuracy of train {train_score} and of test {test_score}')

Accuracy of train 0.837157098861262 and of test 0.7841819591625743